{
  "WorkshopId": 3569548739,
  "Title": "Tinkering Bytes",
  "Description": "Current Version is v0.0.3\n\n[h3]Now safe(r) to update mid-save![/h3]\nDedicated migration code has been added with the express purpose of catching some of the edge-cases when a substantial change is made to the mod's internal components. Saves with an older version of this mod should better handle migrating to newer versions.\n\n[h3]Safe-ish to add mid-save![/h3]\nEfforts have been made to ensure there is minimal friction in adding this mod mid-save. As always, the recommendation with mods is to create a new save if you're adding any, but for those of us who are prone to flouting great wisdom, the next best thing is trying to make the process smooth.\n\nSaves this mod was already added to mid-save [i]should[/i] still see the benefits of this update, but no guarantees.\n\n[h2]Introduction[/h2]\nThis mod adds a whole suite of new and modified functionality to tinker trader NPCs. \n\nTinker traders can now tinker items for you, modify items for you, and disassemle items for you, all for a modest(?) fee.\n\nOverall, paying for tinkering is more expensive than simply doing it yourself, but with this mod it should hopefully be possible to not miss out on so much the tinkering system while playing a character that hasn't invested in it at all.\n\nThis mod also makes the existing tinkering options more expensive by the inclusion of dram-value bit costs, but, unlike vanilla, they're now affected by trade performance, meaning they go down as your ego and faction rep go up.\n\n[h2]Draftable Data Disks![/h2]\nSelect NPCs who live in a certain enclave (expect more in the future) are able to draft disks, for a fee, for any recipes they know.\n\nTo play off this, a couple of NPCs are also able to learn recipes by reverse engineering that they lack the tinkering skill to tinker, and get a bonus to their chance to learn via reverse engineer. The idea is to add an incentive to keep these NPCs around specifically to disassemble for you, since they can draft disks of these recipes for you.\n\n[spoiler] Neek is one such NPC; good at the \"pull-apart\" bit, not so good at the \"put back together\" bit [/spoiler]\n\nThis feature will be expanded on in the future and made a tiny bit more common to come across.\n\n[h2]Learnable Recipes![/h2]\n[h3]Changes[/h3]\nTinker NPCs will now only occasionally learn (and consume) a data disk they would have otherwise stocked, and will less frequently draft a disk for a recipe they know when they restock.\n\nTinker NPCs who learn the masterwork mod will be bestowed a Maker's Mark.\n\n[h3]Features[/h3]\nAlso added is the ability for tinker traders to learn and know recipes (and have them installed if they're genetically inclined). They can tinker for you any recipes they know, provided you also know what the item in question is (they can help you understand them, for a fee). They can also tinker from data disks you bring them, again, if you know what's on the disk (again, they can help you understand for a fee).\n\n[h2]Tinkering![/h2]\nWhen trading with a tinker, you'll now be able to see the contents of their bit locker, which they'll be able to draw from to complete your tinkering requests. Their bit locker restocks at the same time as their inventory does, and its contents are scaled to their tinkering abilities.\n\nTo initiate tinkering actions, simply begin trade with a tinker, and use the actions menu on various items, data disks, and the new \"tinker recipe\" pseudo-items added by the mod (extended from my Vendor Action Events library).\n\nWhen having something tinkered, modified, repaired, or recharged, you'll be prompted to select who will provide any required ingredients, and who will provide any required bits. Anything provided by either party will need to be in possession of that party. Anything provided by the tinker will cost what it would have cost to purchase that item or, in the case of bits, the equivalent scap.\n\nCan't afford the cost of having an item tinkered? That's okay! If the price is right, and the tinker is providing all the materials, they'll hold onto it for you for a deposit that is the difference between the cost to tinker the item and the item's value itself. In essence, if an item worth 10 drams would cost 15 drams to tinker, the trader will tinker it for a deposit of 5 drams and hold it for 2 restocks for you to come back and purchase it for 10 drams.\n\n[h2]Reworks[/h2]\nRepairing and recharging have both been reworked (there are options to use vanilla instead), and will utilise the same system of requiring the necessary bits to action.\n\n[h2]Disassembly[/h2]\n[h3]Improvements[/h3]\nDisassembly has been made more robust (it should have fewer bugs now), and can also be paid for in amounts between \"1\" and \"all\" instead of only those two options (select disassemble, and you'll be asked for an amount).\n\n[h3]Features[/h3]\nTinkers will disassemble items and scrap for you for a fee. The fee is paltry, although more expensive for higher tier bits, and is always less expensive than purchasing those bit from the tinker. \n\nAny disassembly a tinker trader does for you is bits directly into your bit locker.\n\nSelecting disassemble all will put you and the trader into a queued action (like when doing it yourself), which can be interrupted if, for example, a hostile creature pops up. This is largely for balance (so that paying for disassembly isn't better that doing it yourself), but also flavour.\n\nYou only pay for the exact number of disassembly actions performed, and you only get as many bits.\n\nTinker traders with reverse engineer are able to learn tinkering recipes using the exact same rules as the player when they disassemble things on the player's behalf.\n\nBefriend a tinker and drag them around with you to disassemble items, learn recipes, and tinker grenades for you to accidentally kill them with, making you sad.\n\n[h2]Bytes and Punnets of Bytes[/h2]\nBits can be tinkered into an that represents a stack of 8 of a given bit, called a byte, which can be reliably disassembled back into 8 of the given bit. This is perfect for moving the bulk of your bits to a new body if you're so inclined, but also provides the opportunity for something to drop when a creature with a bit locker happens to be slain.\n\nUpon death, creatures with a bit locker will drop a percentage of their held bits into piles of bytes and scrap.\n\nByte punnets are a pack of 32 of a given byte, totaling 256 of the given bit. They can unpacked (not disassembled), into the 32 bytes they comprised of, which can then be disassembled.\n\nA punnet can drop if a slain creature had enough of a given bit that, after the percentage is calculated, one [i]could[/i] drop.\n\n[h2]More?[/h2]\nYeah, definitely. The mod addresses some BitBucket issues I discovered while making this mod. There's information in the mod's options, since the fixes implemented are entirely optional. I'll write more details about them here when I get a chance.\n\nI normally try to leave opinionated \"fixes\" as opt-in, but these are \"acknowledged bugs\", and they relate to the spirit of the mod, so they're opt-out this time.\n\n[h2]Disclaimer[/h2]\nI'm a hobbyist modder and best, and a hack at the best of times. I'll do my best to make sure bugs get fixed and balancing issues are addressed, but this has a been big project and I'm often time poor.\n\nThat said, I'm always open to feedback and suggestions, [i]and[/i] collaborating if the fit is right.\n\nThis mod depends on [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3568648352]Vendor Action Events (library)[/url] and [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3568646682]UnderDoug's Modding Toolbox (library)[/url].\r\n\r\n[h2]Source[/h2]\r\nWant to see how it's made? There's a [url=https://github.com/UnderDoug/UD_Tinkering_Bytes]git repository[/url]!\r\n\r\nLicence is the \"Unlicence\". I don't know what that means, but I also don't care what you do with it. Easy.",
  "Tags": "Tinkering,Extension,Quality of life",
  "Visibility": "2",
  "ImagePath": "preview.png"
}